Practicas/PracticasGretl/Lecc08.org
#+title:  Lección 8
#+author: Marcos Bujosa
#+STARTUP: show4levels
#+LANGUAGE: es-es

#+EXPORT_FILE_NAME: pub/Lecc08

# +OPTIONS: toc:nil
#+OPTIONS: tags:nil

#+LATEX_CLASS: article

#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LaTeX_HEADER: \usepackage[svgnames,x11names]{xcolor}
#+LaTeX_HEADER: \hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
#+LaTeX_HEADER: \PassOptionsToPackage{hyphens}{url}
#+LaTeX_HEADER: \usepackage{nacal}

#+bibliography: ref.bib

#+LaTeX_HEADER: \usepackage{framed}

#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \input{hansl.tex}
#+LaTeX_HEADER: \lstnewenvironment{hansl-gretl}
#+LaTeX_HEADER: {\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
#+LaTeX_HEADER: {}
#+LaTeX_HEADER: \newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{white},basicstyle=\ttfamily\footnotesize,breaklines=true, captionpos=b,commentstyle=\color{mygreen},escapeinside={\%*}{*)}, keywordstyle=\color{blue},stringstyle=\color{mymauve}, }
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20},basicstyle=\ttfamily\footnotesize,breaklines=true, }
#+LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20}, }

#+name: setup-listings
#+begin_src emacs-lisp :exports none :results silent
  (setq org-latex-listings 'listings)
  (setq org-latex-custom-lang-environments
  	;'((emacs-lisp "common-lispcode")))
  	'((emacs-lisp "hansl-gretl")))
  (setq org-latex-listings-options
	'(("frame" "lines")
	  ("basicstyle" "\\scriptsize")
	  ("basicstyle" "\\ttfamily")
	  ("numbers=none" "left")
	  ("backgroundcolor=\\color{lightgray!20}")
	  ("numberstyle" "\\tiny")))
  (setq org-latex-to-pdf-process
	'("pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"))
  (org-add-link-type
   "latex" nil
   (lambda (path desc format)
     (cond
      ((eq format 'html)
       (format "<span class=\"%s\">%s</span>" path desc))
      ((eq format 'latex)
       (format "\\%s{%s}" path desc)))))
#+end_src


# \lstnewenvironment{code}
#     {\lstset{language=haskell,
#     basicstyle=\small\ttfamily,
#     numbers=left,
#     numberstyle=\tiny\color{gray},
#     backgroundcolor=\color{lightgray},
#     firstnumber=auto
#     }}
#     {}

#+bibliography: ref.bib

# +latex: \clearpage

#+LATEX: \clearpage

* Intervalos y regiones de confianza
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/EjPvivienda4.inp
   :END:

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/EjPvivienda4.inp][EjPvivienda4.inp]] |

Cargue los datos de precios de casas ~data3-1.gdt~ del libro de
Ramanthan.
#+begin_src hansl 
 open data3-1
#+end_src
    
+ Estime el modelo de siempre y guárdelo como icono.
  #+begin_src hansl 
   Modelo1 <- ols price const sqft --vcv
  #+end_src

+ Observe la matriz de covarianzas entre los parámetros estimados del
  modelo de regresión. Hay covarianza entre los estimadores, ¿con qué
  signo?
  
+ Calcule los intervalos de confianza de los parámetros beta
  estimados: desde la ventana del modelo estimado siga los pasos
  */~Análisis -> Intervalos de confianza para los coeficientes~/* o
  bien directamente en un guión o la consola de Gretl aplique
  directamente las expresiones vistas en clase:
  #+begin_src hansl 
   scalar ns = 0.05  # nivel de signifacion
   
   scalar i1 = $coeff(const) - critical(t, $df, ns/2) * $stderr(const)
   scalar s1 = $coeff(const) + critical(t, $df, ns/2) * $stderr(const)
   
   scalar i2 = $coeff(sqft)  - critical(t, $df, ns/2) * $stderr(sqft)
   scalar s2 = $coeff(sqft)  + critical(t, $df, ns/2) * $stderr(sqft)
   
   matrix IC = {i1, s1; i2, s2}
   print IC
  #+end_src
      
+ Recuerde que los intervalos de confianza al 95% nos sirven para
  contrastar hipótesis al 5% de significación. Piense qué valores
  están en el umbral de ser rechazados según los intervalos obtenidos.
      
+ Dado el signo de la covarianza entre los estimadores, ¿qué relación
  cabe esperar entre ellos?
      
+ Visualice la región de confianza de los parámetros: desde en la
  ventana del modelo estimado siga los pasos */~Análisis -> Elipse de
  confianza~/* y seleccione ambos regresores para ver la elipse de
  confianza. ¿Confirma sus expectativas?
      
+ Contrastemos algunas hipótesis compuestas. En particular, contraste
  las distintas combinaciones de valores que están en el umbral de ser
  hipótesis a rechazar individualmente (las correspondientes a las
  esquinas del cuadrado que se ve en el gráfico del apartado
  anterior). En la ventana del modelo */~Contrastes -> Restricciones
  lineales~/* y se introducen las restriciones; o bien ejecute el
  código de más abajo.

  ¿Cuál es la conclusión respecto a la elipse de confianza en relación
  a los contrastes de hipótesis de dos parámetros?
  #+begin_src hansl 
   restrict Modelo1
    b[1] = i1
    b[2] = s2
   end restrict
   
   restrict Modelo1
    b[1] = s1
    b[2] = s2
   end restrict
   
   restrict Modelo1
    b[1] = i1
    b[2] = i2
   end restrict
   
   restrict Modelo1
    b[1] = s1
    b[2] = i2
   end restrict
   
   /* notese que el contraste individual H0: b[2]=i2 esta en el limite de ser rechazado al 5% 
      Pero si conjuntamente tambien se considera que b[1]=s1 entonces no se rechaza ni con un
      13% de sigificacion */
  #+end_src
   
#   scalar t2 = ($coeff(sqft)-i2)/$stderr(sqft)    # estadistico t
#   scalar c2 = critical(t, $df, .025)             # valor crítico al 5% (dos colas)
#   scalar p2 = 2*pvalue(t, $df, abs(t2))          # p-valor

  
# +LATEX: \clearpage
#+latex: \vspace{10pt}
#+latex: \noindent
** Código completo de la práctica ~EjPvivienda4.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/EjPvivienda4.inp}
#+LATEX: \clearpage


