Practicas/PracticasGretl/pub/Lecc08.tex
% Created 2023-11-12 dom 23:11
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish, ]{babel}
\usepackage[margin=0.5in]{geometry}
\usepackage[svgnames,x11names]{xcolor}
\hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
\PassOptionsToPackage{hyphens}{url}
\usepackage{nacal}
\usepackage{framed}
\usepackage{listings}
\input{hansl.tex}
\lstnewenvironment{hansl-gretl}
{\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
{}
\newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
\lstset{backgroundcolor=\color{lightgray!20}, }
\author{Marcos Bujosa}
\date{\today}
\title{Lección 8}
\begin{document}

\maketitle
\tableofcontents

\clearpage

\section{Intervalos y regiones de confianza}
\label{sec:org79452d8}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/EjPvivienda4.inp}{EjPvivienda4.inp}\\[0pt]
\end{tabular}
\end{center}

Cargue los datos de precios de casas \texttt{data3-1.gdt} del libro de
Ramanthan.
\begin{verbatim}
open data3-1
\end{verbatim}

\begin{itemize}
\item Estime el modelo de siempre y guárdelo como icono.
\begin{verbatim}
Modelo1 <- ols price const sqft --vcv
\end{verbatim}

\item Observe la matriz de covarianzas entre los parámetros estimados del
modelo de regresión. Hay covarianza entre los estimadores, ¿con qué
signo?

\item Calcule los intervalos de confianza de los parámetros beta
estimados: desde la ventana del modelo estimado siga los pasos
\textbf{\emph{\texttt{Análisis -> Intervalos de confianza para los coeficientes}}} o
bien directamente en un guión o la consola de Gretl aplique
directamente las expresiones vistas en clase:
\begin{verbatim}
scalar ns = 0.05  # nivel de signifacion

scalar i1 = $coeff(const) - critical(t, $df, ns/2) * $stderr(const)
scalar s1 = $coeff(const) + critical(t, $df, ns/2) * $stderr(const)

scalar i2 = $coeff(sqft)  - critical(t, $df, ns/2) * $stderr(sqft)
scalar s2 = $coeff(sqft)  + critical(t, $df, ns/2) * $stderr(sqft)

matrix IC = {i1, s1; i2, s2}
print IC
\end{verbatim}

\item Recuerde que los intervalos de confianza al 95\% nos sirven para
contrastar hipótesis al 5\% de significación. Piense qué valores
están en el umbral de ser rechazados según los intervalos obtenidos.

\item Dado el signo de la covarianza entre los estimadores, ¿qué relación
cabe esperar entre ellos?

\item Visualice la región de confianza de los parámetros: desde en la
ventana del modelo estimado siga los pasos \textbf{\emph{\texttt{Análisis -> Elipse de
  confianza}}} y seleccione ambos regresores para ver la elipse de
confianza. ¿Confirma sus expectativas?

\item Contrastemos algunas hipótesis compuestas. En particular, contraste
las distintas combinaciones de valores que están en el umbral de ser
hipótesis a rechazar individualmente (las correspondientes a las
esquinas del cuadrado que se ve en el gráfico del apartado
anterior). En la ventana del modelo \textbf{\emph{\texttt{Contrastes -> Restricciones
  lineales}}} y se introducen las restriciones; o bien ejecute el
código de más abajo.

¿Cuál es la conclusión respecto a la elipse de confianza en relación
a los contrastes de hipótesis de dos parámetros?
\begin{verbatim}
restrict Modelo1
 b[1] = i1
 b[2] = s2
end restrict

restrict Modelo1
 b[1] = s1
 b[2] = s2
end restrict

restrict Modelo1
 b[1] = i1
 b[2] = i2
end restrict

restrict Modelo1
 b[1] = s1
 b[2] = i2
end restrict

/* notese que el contraste individual H0: b[2]=i2 esta en el limite de ser rechazado al 5% 
   Pero si conjuntamente tambien se considera que b[1]=s1 entonces no se rechaza ni con un
   13% de sigificacion */
\end{verbatim}
\end{itemize}


\vspace{10pt}
\noindent
