Practicas/PracticasGretl/Lecc08.org
* Experimento de Montecarlo para los intervalos de confianza
   
| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/samplinghouses5.inp][samplinghouses5.inp]] |

Cargue los datos de precios de casas ~data3-1.gdt~ del libro de
Ramanthan.  Este experimento de Montecarlo es una extensión a los ya
realizados con estos mismos datos.

+ Defina la serie =x= con las superficies y la serie =y= con los
  precios. Programe un bucle como las otras veces:
  #+begin_src hansl :noweb tangle :tangle ./pub/scripts/samplinghouses5.inp
   open data3-1
   series x = sqft
   series y = price
   #set seed 3213798
   loop 100 --progressive --quiet
       <<Estimación MCO>>
       <<Cálculo de los límites de los intervalos de confianza>>
       <<Comprobación de si los parámetros pertenecen al intervalo>>
       <<Estimación de la varianza de los errores>>
       <<Muestra de resultados y guardado en disco>>
   endloop
  #+end_src

La serie de cálculos son los siguientes (todos dentro del bucle).
  
1) El primer bloque de cálculos simula el modelo con nuevas
   perturbaciones, lo estima por MCO y guarda los betas estimados y
   sus errores estándar:
   #+name: Estimación MCO
   #+begin_src hansl 
    series U  = randgen(n, 0, 39)
    series ys = 52 + 0.14*x + U
    ols ys const x
    scalar b1 = $coeff(const)
    scalar b2 = $coeff(x)
    scalar s1 = $stderr(const)
    scalar s2 = $stderr(x)
   #+end_src
   
2) Luego calculamos los intervalos de confianza al 95\%
   #+name: Cálculo de los límites de los intervalos de confianza
   #+begin_src hansl 
    scalar c1L = b1 - critical(t,$df,.025)*s1
    scalar c1R = b1 + critical(t,$df,.025)*s1
    scalar c2L = b2 - critical(t,$df,.025)*s2
    scalar c2R = b2 + critical(t,$df,.025)*s2
   #+end_src

3) Verificamos si los verdaderos valores pertenecen al intervalo estimado
   #+name: Comprobación de si los parámetros pertenecen al intervalo
   #+begin_src hansl 
    scalar p1 = (52  >c1L && 52  <c1R)
    scalar p2 = (0.14>c2L && 0.14<c2R)
   #+end_src

4) Al finalizar todas las cuentas, queremos que Gretl nos muestre los
   estadísticos de los parámetros estimados, y el porcentaje de veces
   que el intervalo contuvo a los parámetros, y que guarde todo lo
   calculado en el fichero de datos ~cicoeff.gdt~.
   #+name: Muestra de resultados y guardado en disco
   #+begin_src hansl 
    print b1 b2 p1 p2 
    store cicoeff.gdt b1 b2 c1L c1R c2L c2R 
   #+end_src

Por último abrimos el fichero ~cicoeff.gdt~. Generamos una serie =B1=
constante e igual a valor del parámetro constante del modelo simulado ($52$)
y otra =B2= igual a valor del parámetro de la pendiente del modelo
simulado ($0.14$); y finalmente generamos unos gráficos que muestren los
intervalos estimados en cada iteración y si incluyen o no al verdadero
valor del parámetro correspondiente.
#+begin_src hansl :noweb tangle :tangle ./pub/scripts/samplinghouses5.inp
  open "cicoeff.gdt"
  series B1 = 52
  series B2 = 0.14
  IntervaloConstante <- gnuplot c1L c1R B1 --time-series --with-lines --output="display"
  IntervaloPendiente <- gnuplot c2L c2R B2 --time-series --with-lines --output="display"
#+end_src

# +LATEX: \clearpage
#+latex: \vspace{10pt}
#+latex: \noindent
** Código completo de la práctica ~samplinghouses5.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/samplinghouses5.inp}
#+LATEX: \clearpage


* Precio de casas unifamiliares (constante más tres regresores)
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/Houses.inp
   :END:

   | Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/Houses.inp][Houses.inp]] |

   
- Objetivos. :: Son tres:
  - Asimilar la interpretación ``ceteris paribus'' de los coeficientes de un modelo de regresión.
  - Eliminar variables no significativas de un modelo.
  - Comparar el ajuste de dos modelos.
    
- Los datos :: son los del ejemplo de clase junto con dos variables
  adicionales: número de dormitorios (=bedrms=) y cuartos de baño
  (=baths=).

- Para empezar :: cargue los datos de la base de datos de Gretl desde
  la pestaña del manual de Ramanathan
  #+begin_src hansl 
   open data4-1
  #+end_src

