Practicas/PracticasGretl/pub/Lecc08.tex
\subsection{Código completo de la práctica \texttt{EjPvivienda4.inp}}
\label{sec:org76d7c4c}
\vspace{10pt}
\lstinputlisting{scripts/EjPvivienda4.inp}
\clearpage


\section{Experimento de Montecarlo para los intervalos de confianza}
\label{sec:orgdc8d8e9}

\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/samplinghouses5.inp}{samplinghouses5.inp}\\[0pt]
\end{tabular}
\end{center}

Cargue los datos de precios de casas \texttt{data3-1.gdt} del libro de
Ramanthan.  Este experimento de Montecarlo es una extensión a los ya
realizados con estos mismos datos.

\begin{itemize}
\item Defina la serie \texttt{x} con las superficies y la serie \texttt{y} con los
precios. Programe un bucle como las otras veces:
\begin{verbatim}
open data3-1
series x = sqft
series y = price
#set seed 3213798
loop 100 --progressive --quiet
    <<Estimación MCO>>
    <<Cálculo de los límites de los intervalos de confianza>>
    <<Comprobación de si los parámetros pertenecen al intervalo>>
    <<Estimación de la varianza de los errores>>
    <<Muestra de resultados y guardado en disco>>
endloop
\end{verbatim}
\end{itemize}

La serie de cálculos son los siguientes (todos dentro del bucle).

\begin{enumerate}
\item El primer bloque de cálculos simula el modelo con nuevas
perturbaciones, lo estima por MCO y guarda los betas estimados y
sus errores estándar:
\begin{verbatim}
series U  = randgen(n, 0, 39)
series ys = 52 + 0.14*x + U
ols ys const x
scalar b1 = $coeff(const)
scalar b2 = $coeff(x)
scalar s1 = $stderr(const)
scalar s2 = $stderr(x)
\end{verbatim}

\item Luego calculamos los intervalos de confianza al 95$\backslash$%
\begin{verbatim}
scalar c1L = b1 - critical(t,$df,.025)*s1
scalar c1R = b1 + critical(t,$df,.025)*s1
scalar c2L = b2 - critical(t,$df,.025)*s2
scalar c2R = b2 + critical(t,$df,.025)*s2
\end{verbatim}

\item Verificamos si los verdaderos valores pertenecen al intervalo estimado
\begin{verbatim}
scalar p1 = (52  >c1L && 52  <c1R)
scalar p2 = (0.14>c2L && 0.14<c2R)
\end{verbatim}

\item Al finalizar todas las cuentas, queremos que Gretl nos muestre los
estadísticos de los parámetros estimados, y el porcentaje de veces
que el intervalo contuvo a los parámetros, y que guarde todo lo
calculado en el fichero de datos \texttt{cicoeff.gdt}.
\begin{verbatim}
print b1 b2 p1 p2 
store cicoeff.gdt b1 b2 c1L c1R c2L c2R 
\end{verbatim}
\end{enumerate}

Por último abrimos el fichero \texttt{cicoeff.gdt}. Generamos una serie \texttt{B1}
constante e igual a valor del parámetro constante del modelo simulado (\(52\))
y otra \texttt{B2} igual a valor del parámetro de la pendiente del modelo
simulado (\(0.14\)); y finalmente generamos unos gráficos que muestren los
intervalos estimados en cada iteración y si incluyen o no al verdadero
valor del parámetro correspondiente.
\begin{verbatim}
open "cicoeff.gdt"
series B1 = 52
series B2 = 0.14
IntervaloConstante <- gnuplot c1L c1R B1 --time-series --with-lines --output="display"
IntervaloPendiente <- gnuplot c2L c2R B2 --time-series --with-lines --output="display"
\end{verbatim}

\vspace{10pt}
\noindent
\subsection{Código completo de la práctica \texttt{samplinghouses5.inp}}
\label{sec:org8b6cbcc}
\vspace{10pt}
\lstinputlisting{scripts/samplinghouses5.inp}
\clearpage


\section{Precio de casas unifamiliares (constante más tres regresores)}
\label{sec:orge6d7877}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/Houses.inp}{Houses.inp}\\[0pt]
\end{tabular}
\end{center}


\begin{description}
\item[{Objetivos.}] Son tres:
\begin{itemize}
\item Asimilar la interpretación ``ceteris paribus'' de los coeficientes de un modelo de regresión.
\item Eliminar variables no significativas de un modelo.
\item Comparar el ajuste de dos modelos.
\end{itemize}

\item[{Los datos}] son los del ejemplo de clase junto con dos variables
adicionales: número de dormitorios (\texttt{bedrms}) y cuartos de baño
(\texttt{baths}).

\item[{Para empezar}] cargue los datos de la base de datos de Gretl desde
la pestaña del manual de Ramanathan
\begin{verbatim}
open data4-1
\end{verbatim}
\end{description}
