Practicas/PracticasGretl/Lecc08.org
** Tareas

+ Actividad 1 :: Piense cuáles son los signos esperados de los
  parámetros del siguiente modelo
   \begin{displaymath}
      \VA{price}=
      \beta_1\VAindUno+
      \beta_2\VA{sqft}+
      \beta_3\VA{bedrms}+
      \beta_4\VA{baths}+
      \per.
    \end{displaymath}
    donde \VA{price} es el precio de una vivienda, \VA{sqft} su
  superficie, \VA{bedrms} es su número de dormitorios y \VA{baths} su
  número de cuartos de baño.

+ Actividad 2 :: Con los datos de la muestra Ajuste dicho modelo de
  regresión por MCO y guárdelo como un icono.
  #+begin_src hansl 
   Modelo1 <- ols price 0 sqft bedrms baths 
  #+end_src

+ Actividad 3 :: ¿Confirman los resultados su previsión respecto a los
  signos de los parámetros? 

  # La interpretación de los coeficientes es ceteris paribus, es decir,
  # manteniendo el resto de variables sin cambios. Así, $\beta_3$ es el
  # efecto esperado de añadir una habitación manteniendo el mismo tamaño
  # de casa.

+ Actividad 4 :: El modelo estimado sugiere que una casa de $1600$ pies al cuadrado,
  con $3$ habitaciones y $2$ cuartos de baño tiene un precio esperado de
  \begin{displaymath}
    129.062 + 0.154800\times(1600) -21.5875\times(3) -12.1928\times(2) =  287.59 \; \text{miles de dólares.}
  \end{displaymath}
  
  Según este modelo (y sabiendo que un pie cuadrado son $0.092m^2$)
  /ampliar/ esta casa con una habitación adicional de unos $20$ metros
  cuadrados (unos $220$ pies cuadrados más de casa) arrojaría un
  precio esperado de ¿cuanto?
  \begin{displaymath}
     129.062 + 0.154800\times(1820) -21.5875\times(4) -12.1928\times(2) =  300.06;
  \end{displaymath}
  es decir, /ampliar/ esta casa con una habitación adicional de unos
  $20$ metros cuadrados /eleva/ el precio en unos $13$ mil dolares.
  ¿Contradice esto su idea inicial?
  #+begin_src hansl
   series yhat1 = $coeff(const)+$coeff(sqft)*1600+$coeff(bedrms)*3+$coeff(baths)*2
   series yhat2 = $coeff(const)+$coeff(sqft)*(1600+220)+$coeff(bedrms)*(3+1)+$coeff(baths)*2
  #+end_src

+ Actividad 5 :: Aunque, con la correcta interpretación de los
  coeficientes, el resultado parece sensato, sólo una de las variables
  es estadísticamente significativa.

  - Esto quiere decir, que la estimación de los parámetros es muy
    imprecisa. Sin embargo, el estadístico $\Festadistico$ indica que
    el modelo es conjuntamente significativo (así que la previsión de
    precios de la actividad anterior es fiable); pero no el efecto
    individual de cada regresor.

  - Observe además que hay un elevado grado de correlación entre los
    regresores (en la ventana de iconos, ``pinche'' en
    */~Correlaciones~/*) o ejecute los siguiente
    #+begin_src hansl
     corr sqft bedrms baths
    #+end_src
    Esto sugiere que pudiera surgir un problema de multicolinealidad.
    Además, la interpretación caeteris paribus cuestiona la relevancia
    de algunos los regresores. Todo ello apunta a la posible
    conveniencia de excluir uno o más regresores del modelo inicial.

+ Actividad 6 :: Puesto que la variable menos significativa es
  =baths=, ésta será la primera variable a omitir del modelo inicial:
  - En la ventana del Modelo 1, ``pinche'' en */~Contrastes ->
    omitir variables~/* y seleccione la variable =baths= (y pulse
    */~Aceptar~/*). O bien ejecute el código
    #+begin_src hansl
     omit baths
    #+end_src
    Note como el coeficiente de determinación ha disminuido, pero el
    corregido ha aumentado.

  Aunque ha aumentado la significatividad de los coeficientes,
  =bedrms= continua siendo no significativa. Así que la vamos a
  omitir:
  - En la ventana del Modelo 1, ``pinche'' en */~Contrastes ->
    omitir variables~/* y seleccione la variable =bedrms= (y pulse
    */~Aceptar~/*). O bien ejecute el código
    #+begin_src hansl
     omit bedrms
    #+end_src
    Note como de nuevo el coeficiente de determinación ha
    disminuido, pero el corregido ha aumentado.

  /La constante sigue sin ser significativa ¿debemos hacer como con
  =baths= y =bedrms= y tratar de omitirla también?/

+ Actividad 7 :: Hemos excluido las variables =baths= y =bedrms= del
  modelo original, debido a que individualmente son no significativas.

  Pero pudiera ocurrir que conjuntamente si fueran
  significativas. Vamos a verificar que conjuntamente tampoco son
  significativas:
  
  - En la ventana del Modelo 1, ``pinche'' en */~Análisis -> Elipse de
    confianza~/* y seleccione =baths= y =bedrms=.

  - Compruebe que $(0,0)$ es un punto que pertenece a la elipse de
    confianza, y que por tanto, la hipótesis nula $\beta_3=0,\;
    \beta_4=0$ no se puede rechazar al nivel de confianza de la
    elipse.
    
  - Omita de golpe las dos variables: En la ventana del Modelo 1,
    ``pinche'' en */~Contrastes -> omitir variables~/* y seleccione
    las variables =baths= y =bedrms= (y pulse */~Aceptar~/*)
    #+begin_src hansl
     ols price 0 sqft bedrms baths
     Modelo2 <- omit baths bedrms
    #+end_src

  - Observe los resultados.


+ Actividad 8 :: Comparar las previsiones del modelo ampliado y el
  reducido.

  Vamos a comprobar que las predicciones no difieren demasiado entre
  uno y otro modelo. Pero hay mayor precisión con el modelo reducido
  (no multicolinealidad).

  /Primero añadimos una observación adicional/ con los datos de
  superficie, número de dormitorios y cuartos de baño del ejemplo
  anterior.
  - ``Pinche'' en */~Datos -> Añadir observaciones~/* y añada una observación

  - Marque con el ratón las variables =sqft=,
      =bedrms= y =baths=}, y con las tres variables
      marcadas, pinche en */~Datos -> Editar valores~/*. Teclee $1820$
      en la fila $15$ de la columna =sqft=, teclee $4$ en la fila
      $15$ de la columna =bedrms= y $2$ en la fila $15$ de la columna
      =baths=.

  - Fije la muestra con las nuevas observaciones: ``pinche'' en
    */~Muestra -> Establecer rango~/* y fíjelo para las observaciones
    de 1 a 15.  O bien teclee en la  consola de comandos
    #+begin_src hansl
     dataset addobs 1
     genr sqft[15] =1820
     genr bedrms[15]=4
     genr baths[15] =2
    #+end_src

  - Re-estime el primer modelo pero usando la muestra ampliada.
    #+begin_src hansl
     smpl 1 15
     ols price const sqft bedrms baths
    #+end_src

    + En la ventana del modelo re-estimado ``pinche'' en */~Análisis
      -> Predicciones~/*. Nos aseguramos de que el dominio de
      predicción contiene la observación 15 y pulsamos */~Aceptar~/*.
      #+begin_src hansl
       fcast 15 15 --static
       fcast --plot="display"
      #+end_src

    + Observe la previsión puntual y el intervalo de confianza

  - Re-estime también el segundo modelo con la muestra ampliada
    #+begin_src hansl
     ols price const sqft
    #+end_src

    + En la ventana del modelo re-estimado ``pinche'' en */~Análisis
      -> Predicciones~/*. Asegúrese de que el dominio de predicción
      contiene la observación 15 y pulse */~Aceptar~/*.
      #+begin_src hansl
       fcast 15 15 --static
       fcast --plot="display"
      #+end_src

  - Note cómo ambas previsiones puntuales están contenidas en
    ambos intervalos, por lo que no son estadísticamente distintas.

  - Pero fíjese en cómo la falta de precisión del primer modelo se
    plasma en una mayor desviación típica, y en un intervalo de
    confianza más amplio.

# +LATEX: \clearpage
# +latex: \vspace{10pt}
# +latex: \noindent
** Código completo de la práctica ~Houses.inp~
# +latex: \vspace{10pt}
\lstinputlisting{scripts/Houses.inp}
#+LATEX: \clearpage


