Practicas/PracticasGretl/pub/Lecc08.tex

\subsection{Tareas}
\label{sec:org47dda6c}

\begin{description}
\item[{Actividad 1}] Piense cuáles son los signos esperados de los
parámetros del siguiente modelo
\begin{displaymath}
   \VA{price}=
   \beta_1\VAindUno+
   \beta_2\VA{sqft}+
   \beta_3\VA{bedrms}+
   \beta_4\VA{baths}+
   \per.
 \end{displaymath}
  donde \VA{price} es el precio de una vivienda, \VA{sqft} su
superficie, \VA{bedrms} es su número de dormitorios y \VA{baths} su
número de cuartos de baño.

\item[{Actividad 2}] Con los datos de la muestra Ajuste dicho modelo de
regresión por MCO y guárdelo como un icono.
\begin{verbatim}
Modelo1 <- ols price 0 sqft bedrms baths 
\end{verbatim}

\item[{Actividad 3}] ¿Confirman los resultados su previsión respecto a los
signos de los parámetros?

\item[{Actividad 4}] El modelo estimado sugiere que una casa de \(1600\) pies al cuadrado,
con \(3\) habitaciones y \(2\) cuartos de baño tiene un precio esperado de
\begin{displaymath}
  129.062 + 0.154800\times(1600) -21.5875\times(3) -12.1928\times(2) =  287.59 \; \text{miles de dólares.}
\end{displaymath}

Según este modelo (y sabiendo que un pie cuadrado son \(0.092m^2\))
\emph{ampliar} esta casa con una habitación adicional de unos \(20\) metros
cuadrados (unos \(220\) pies cuadrados más de casa) arrojaría un
precio esperado de ¿cuanto?
\begin{displaymath}
   129.062 + 0.154800\times(1820) -21.5875\times(4) -12.1928\times(2) =  300.06;
\end{displaymath}
es decir, \emph{ampliar} esta casa con una habitación adicional de unos
\(20\) metros cuadrados \emph{eleva} el precio en unos \(13\) mil dolares.
¿Contradice esto su idea inicial?
\begin{verbatim}
series yhat1 = $coeff(const)+$coeff(sqft)*1600+$coeff(bedrms)*3+$coeff(baths)*2
series yhat2 = $coeff(const)+$coeff(sqft)*(1600+220)+$coeff(bedrms)*(3+1)+$coeff(baths)*2
\end{verbatim}

\item[{Actividad 5}] Aunque, con la correcta interpretación de los
coeficientes, el resultado parece sensato, sólo una de las variables
es estadísticamente significativa.

\begin{itemize}
\item Esto quiere decir, que la estimación de los parámetros es muy
imprecisa. Sin embargo, el estadístico \(\Festadistico\) indica que
el modelo es conjuntamente significativo (así que la previsión de
precios de la actividad anterior es fiable); pero no el efecto
individual de cada regresor.

\item Observe además que hay un elevado grado de correlación entre los
regresores (en la ventana de iconos, ``pinche'' en
\textbf{\emph{\texttt{Correlaciones}}}) o ejecute los siguiente
\begin{verbatim}
corr sqft bedrms baths
\end{verbatim}
Esto sugiere que pudiera surgir un problema de multicolinealidad.
Además, la interpretación caeteris paribus cuestiona la relevancia
de algunos los regresores. Todo ello apunta a la posible
conveniencia de excluir uno o más regresores del modelo inicial.
\end{itemize}

\item[{Actividad 6}] Puesto que la variable menos significativa es
\texttt{baths}, ésta será la primera variable a omitir del modelo inicial:
\begin{itemize}
\item En la ventana del Modelo 1, ``pinche'' en \textbf{\emph{\texttt{Contrastes ->
    omitir variables}}} y seleccione la variable \texttt{baths} (y pulse
\textbf{\emph{\texttt{Aceptar}}}). O bien ejecute el código
\begin{verbatim}
omit baths
\end{verbatim}
Note como el coeficiente de determinación ha disminuido, pero el
corregido ha aumentado.
\end{itemize}

Aunque ha aumentado la significatividad de los coeficientes,
\texttt{bedrms} continua siendo no significativa. Así que la vamos a
omitir:
\begin{itemize}
\item En la ventana del Modelo 1, ``pinche'' en \textbf{\emph{\texttt{Contrastes ->
    omitir variables}}} y seleccione la variable \texttt{bedrms} (y pulse
\textbf{\emph{\texttt{Aceptar}}}). O bien ejecute el código
\begin{verbatim}
omit bedrms
\end{verbatim}
Note como de nuevo el coeficiente de determinación ha
disminuido, pero el corregido ha aumentado.
\end{itemize}

\emph{La constante sigue sin ser significativa ¿debemos hacer como con
\texttt{baths} y \texttt{bedrms} y tratar de omitirla también?}

\item[{Actividad 7}] Hemos excluido las variables \texttt{baths} y \texttt{bedrms} del
modelo original, debido a que individualmente son no significativas.

Pero pudiera ocurrir que conjuntamente si fueran
significativas. Vamos a verificar que conjuntamente tampoco son
significativas:

\begin{itemize}
\item En la ventana del Modelo 1, ``pinche'' en \textbf{\emph{\texttt{Análisis -> Elipse de
    confianza}}} y seleccione \texttt{baths} y \texttt{bedrms}.

\item Compruebe que \((0,0)\) es un punto que pertenece a la elipse de
confianza, y que por tanto, la hipótesis nula \(\beta_3=0,\;
    \beta_4=0\) no se puede rechazar al nivel de confianza de la
elipse.

\item Omita de golpe las dos variables: En la ventana del Modelo 1,
``pinche'' en \textbf{\emph{\texttt{Contrastes -> omitir variables}}} y seleccione
las variables \texttt{baths} y \texttt{bedrms} (y pulse \textbf{\emph{\texttt{Aceptar}}})
\begin{verbatim}
ols price 0 sqft bedrms baths
Modelo2 <- omit baths bedrms
\end{verbatim}

\item Observe los resultados.
\end{itemize}
\end{description}


\begin{description}
\item[{Actividad 8}] Comparar las previsiones del modelo ampliado y el
reducido.

Vamos a comprobar que las predicciones no difieren demasiado entre
uno y otro modelo. Pero hay mayor precisión con el modelo reducido
(no multicolinealidad).

\emph{Primero añadimos una observación adicional} con los datos de
superficie, número de dormitorios y cuartos de baño del ejemplo
anterior.
\begin{itemize}
\item ``Pinche'' en \textbf{\emph{\texttt{Datos -> Añadir observaciones}}} y añada una observación

\item Marque con el ratón las variables \texttt{sqft},
\texttt{bedrms} y \texttt{baths}\}, y con las tres variables
marcadas, pinche en \textbf{\emph{\texttt{Datos -> Editar valores}}}. Teclee \(1820\)
en la fila \(15\) de la columna \texttt{sqft}, teclee \(4\) en la fila
\(15\) de la columna \texttt{bedrms} y \(2\) en la fila \(15\) de la columna
\texttt{baths}.

\item Fije la muestra con las nuevas observaciones: ``pinche'' en
\textbf{\emph{\texttt{Muestra -> Establecer rango}}} y fíjelo para las observaciones
de 1 a 15.  O bien teclee en la  consola de comandos
\begin{verbatim}
dataset addobs 1
genr sqft[15] =1820
genr bedrms[15]=4
genr baths[15] =2
\end{verbatim}

\item Re-estime el primer modelo pero usando la muestra ampliada.
\begin{verbatim}
smpl 1 15
ols price const sqft bedrms baths
\end{verbatim}

\begin{itemize}
\item En la ventana del modelo re-estimado ``pinche'' en \textbf{\emph{\texttt{Análisis
      -> Predicciones}}}. Nos aseguramos de que el dominio de
predicción contiene la observación 15 y pulsamos \textbf{\emph{\texttt{Aceptar}}}.
\begin{verbatim}
fcast 15 15 --static
fcast --plot="display"
\end{verbatim}

\item Observe la previsión puntual y el intervalo de confianza
\end{itemize}

\item Re-estime también el segundo modelo con la muestra ampliada
\begin{verbatim}
ols price const sqft
\end{verbatim}

\begin{itemize}
\item En la ventana del modelo re-estimado ``pinche'' en \textbf{\emph{\texttt{Análisis
      -> Predicciones}}}. Asegúrese de que el dominio de predicción
contiene la observación 15 y pulse \textbf{\emph{\texttt{Aceptar}}}.
\begin{verbatim}
fcast 15 15 --static
fcast --plot="display"
\end{verbatim}
\end{itemize}

\item Note cómo ambas previsiones puntuales están contenidas en
ambos intervalos, por lo que no son estadísticamente distintas.

\item Pero fíjese en cómo la falta de precisión del primer modelo se
plasma en una mayor desviación típica, y en un intervalo de
confianza más amplio.
\end{itemize}
\end{description}
\subsection{Código completo de la práctica \texttt{Houses.inp}}
\label{sec:orga940e3e}
\lstinputlisting{scripts/Houses.inp}
\clearpage
