Practicas/PracticasGretl/Lecc08.org
* Los determinantes del número de viajeros de autobús
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/BusTravelers.inp
   :END:

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BusTravelers.inp][BusTravelers.inp]] |

Aplicación 4.6 del libro de texto [cite:@Ramanathan:IEW-98]. Para más
detalles consulte el citado manual.

- Objetivo :: Especificación de un modelo de regresión.

  En general, eliminar variables no significativas incrementa la
  precisión de la estimación del resto de parámetros. Pero eliminar de
  golpe todas las variables no significativas no es recomendable. Al
  quitar algunas variables puede que otras se vuelvan
  significativas. Un procedimiento más cauteloso es ir quitando
  variables de una en una.

  La significación estadística no es el único criterio, ni el más
  conveniente, para tomar una decisión. Si hay razones teóricas para
  mantener una variable debemos cuestionarnos seriamente el quitar
  dicha variable por el mero hecho de que ésta resulte no
  significativa estadísticamente.

  Por otra parte, siempre debemos mantener el término constante.

- Los datos y el modelo :: Ésta es una aplicación con datos reales que
  relaciona el número de horas viajadas en autobús (en miles)
  =Bustravl= (\VA{B}) en 40 ciudades de los Estados Unidos con las
  siguientes variables explicativas:
  + =Fare= = la tarifa del billete en dólares (\VA{F}).
  + =Gasprice= =Precio del galón de gasolina en dólares (\VA{G}).
  + =Income= = Renta percápita media de la ciudad en dólares (\VA{I}).
  + =Pop= = Población de la ciudad en miles (\VA{P}).
  + =Density= = Densidad de población de la ciudad (personas por milla
    cuadrada) (\VA{D}).
  + =Landarea= = Extensión del área urbana en millas cuadradas (\VA{L}).
    
  La especificación inicial del modelo es:
  \begin{displaymath}
    \VA{B}=
    \beta_1\VAindUno+
    \beta_2\VA{F}+
    \beta_3\VA{G}+
    \beta_4\VA{I}+
    \beta_5\VA{P}+
    \beta_6\VA{D}+
    \beta_7\VA{L}+
    \per.
  \end{displaymath}
  Se trata de decidir cuales de todas las variables disponibles es
  razonable mantener en un modelo final.

- Para empezar :: cargue los datos de la base de datos de Gretl desde
  la pestaña del manual de Ramanathan.
  #+begin_src hansl 
   open data4-4
  #+end_src

