Practicas/PracticasGretl/Lecc08.org
** Tareas

+ Actividad 1 :: Piense cuáles son los signos esperados de los parámetros del modelo

+ Actividad 2 :: Observe los diagramas de dispersión entre la variable
  dependiente y los regresores. Observe así mismo los estadísticos
  descriptivos de las variables y la matriz de correlaciones. Hágalo
  con los menus desplegables o ejecutando el siguiente código:
  #+begin_src hansl 
   summary BUSTRAVL FARE GASPRICE INCOME POP DENSITY LANDAREA --simple
   corr BUSTRAVL FARE GASPRICE INCOME POP DENSITY LANDAREA --plot="display"  
   fare_bustravl     <- gnuplot BUSTRAVL FARE     --output="display"
   gasprice_bustravl <- gnuplot BUSTRAVL GASPRICE --output="display"
   income_bustravl   <- gnuplot BUSTRAVL INCOME   --output="display"
   pop_bustravl      <- gnuplot BUSTRAVL POP      --output="display"
   density_bustravl  <- gnuplot BUSTRAVL DENSITY  --output="display"
   landarea_bustravl <- gnuplot BUSTRAVL LANDAREA --output="display"
  #+end_src

+ Actividad 3 :: Estime por MCO el modelo inicial completo y guárdelo como un icono
  #+begin_src hansl 
    ModeloInicial <- ols BUSTRAVL 0 FARE GASPRICE INCOME POP DENSITY LANDAREA
    modeltab add
  #+end_src
  El nombre (en la línea anterior =ModeloInicial=) puede ser el que
  usted elija, pero si tiene espacios en blanco debe escribirlo entre
  comillas, por ejemplo ~"Modelo uno"~ ~<- ols Y 0 x1 x2~). Recuerde
  además que Gretl entiende la variable =0= como el regresor
  constante).
    
  Compare los resultados con sus expectativas iniciales.

  - Observe qué variables son significativas y cuáles no. ¿Cuál es la
    menos significativa?

  - Observe también el coeficiente de determinación ajustado, así como
    los criterios de información para la selección de modelos
    ``Criterio de información de Akaike (AIC)'' y ``Criterio de
    información Bayesiano de Schwarz (BIC)'' para compararlos con
    otros alternativos más adelante.

+ Actividad 4 :: La variable con mayor /p/-valor (``la menos
  significativa'') es el precio del combustible =GASPRICE=.
  Realice una nueva regresión omitiendo esta variable.
    
  Puede hacerlo partiendo del modelo anterior, o definiendo un nuevo
  modelo (le recomiendo la primera):

  - Partiendo del modelo anterior podemos omitir la variable:

    + Desde la ventana del modelo estimado ``pinche'' en */~contrastes
      --> omitir variables~/* seleccione =GASPRICE=; o bien
      ejecute[fn::el comando opuesto a ~omit~ es ~add~]
      #+begin_src hansl 
       omit GASPRICE
      #+end_src

    + Alternativamente podemos definir un nuevo modelo sin =GASPRICE=.
      ``pinchando'' en */~Modelo --> Mínimos Cuadrados Ordinarios~/* y
      seleccionando todos los regresores menos =GASPRICE=, o bien ejecutando
      ~ols BUSTRAVL 0 FARE INCOME POP DENSITY LANDAREA~
      
    Analice los resultados:

    + ¿Mejora la precisión de las estimaciones? ¿Qué variable es ahora
      la menos significativa?

    + Observe también el coeficiente de determinación ajustado, así
      como los criterios de información para la selección de modelos
      ``Criterio de información de Akaike (AIC)'' y ``Criterio de
      información Bayesiano de Schwarz (BIC)''. ¿Le parece que ha
      mejorado el modelo?

+ Actividad 5 :: El mayor /p/-valor corresponde ahora a =FARE=, pero
  la teoría económica sugiere que el precio es una importante variable
  a la hora de explicar la demanda de un bien o servicio. Por ello la
  debemos mantener. La siguiente variable menos significativa (un
  inaceptable /p/-valor del 50%) es la extensión de la ciudad
  =LANDAREA=

  Repita los pasos del punto anterior, pero omitiendo =LANDAREA=.
  #+begin_src hansl 
   omit LANDAREA
  #+end_src

+ Actividad 6 :: La variable =FARE= continua teniendo un /p/-valor
  excesivo (49%). Esto sugiere, que dadas las demás variables
  explicativas, la tarifa del billete no afecta demasiado a la demanda
  de este servicio; es decir, los viajeros no parecer ser muy
  sensibles al precio del billete[fn::al menos para tarifas en torno a
  las observadas en la muestra: alrededor de 0.8 dolares con una
  tarifa mínima de 0.5$ y una máxima de 1.5$.]. Observe de nuevo el
  diagrama de dispersión entre =FARE= y =BUSTRAVL= que siguiere este
  comportamiento. Por tanto, veamos que pasa si finalmente omitimos la
  variable =FARE= (si tenemos fundadas dudas sobre este comportamiento
  de los consumidores, entonces /no deberíamos eliminar la variable/
  =FARE= del modelo).

  Repita los pasos omitiendo =FARE=.
  #+begin_src hansl 
   omit FARE 
  #+end_src

+ Actividad 7 :: Las variables del modelo final son significativas y
  los criterios de selección de modelos han mejorado, pero queda un
  último paso.

  Hemos ido ``quitando'' variables basándonos en los estadísticos
  \Testadistico. Sabemos que esto es incorrecto puesto que
  conjuntamente estas variables podrían ser significativas. Así pues,
  debemos realizar un contraste de significación de las tres variables
  conjuntamente; es decir, partiendo del modelo inicial debemos
  contrastar
  \begin{displaymath}
    \Hnula:\ \beta_2=0,\quad \beta_3=0,\quad \beta_7=0.
  \end{displaymath}

  + /Partiendo del modelo inicial/ omita de golpe las variables
    =FARE=, =GASPRICE= y =LANDAREA= para obtener un modelo
    restringido. Seleccione con el ratón la ventana del primer modelo
    y en */~omitir~/* y marque las tres variables, o bien ejecute el
    código:
    #+begin_src hansl 
     ols BUSTRAVL 0 FARE GASPRICE INCOME POP DENSITY LANDAREA
     ModeloFinal <- omit FARE GASPRICE LANDAREA
     modeltab add
    #+end_src
    ¿Son conjuntamente significativas? ¿Mejora la precisión de las
    estimaciones? ¿y los criterios de selección? ¿Son los signos de
    los parámetros los esperados? A la luz de los resultados, viajar
    en autobús ¿parece ser un bien normal, o un bien inferior?

+ Actividad 8 :: Toda la inferencia que hemos realizado se basa en la
  hipótesis de normalidad de los residuos. Contraste si se puede
  rechazar o no la hipótesis de normalidad en ambos modelos (el
  inicial y el final). El contraste Jarque-Bera es el más frecuente en
  Econometría.
  - En la ventana de resultados de un modelo ``pinche'' en
    */~contrastes --> Normalidad de los residuos~/*, o bien ejecute el
    código:
    #+begin_src hansl 
     series e = $uhat
     normtest --all e
    #+end_src
    Piense que los contrastes realizados en la anteriores actividades,
    asumen la normalidad de las perturbaciones. Si esta hipótesis es
    rechazada toda la inferencia de los contrates anteriores podría
    quedar cuestionada.

*** COMMENT Esto no sé por qué estaba en el guión
#+begin_src hansl 
INCOME-POP     <- gnuplot INCOME POP     --output="display" # diagramas de dispersion con GNUplot
INCOME-DENSITY <- gnuplot INCOME DENSITY --output="display"
#+end_src


** Código completo de la práctica ~BusTravelers.inp~
# +latex: \vspace{10pt}
\lstinputlisting{scripts/BusTravelers.inp}
#+LATEX: \clearpage



* COMMENT Bus Travelers 2
Repite BusTravelers pero con logaritmos... 

#+begin_src hansl 
open data4-4                                  # cargar datos
logs BUSTRAVL FARE GASPRICE INCOME POP DENSITY LANDAREA  
Modelo1 <- ols l_BUSTRAVL const l_FARE l_GASPRICE l_INCOME l_POP l_DENSITY l_LANDAREA 
omit l_DENSITY 
omit l_GASPRICE  
omit l_FARE
ols l_BUSTRAVL const l_FARE l_GASPRICE l_INCOME l_POP l_DENSITY l_LANDAREA 
Modelo2 <- omit l_DENSITY l_GASPRICE l_FARE
#+end_src

* COMMENT Precio de casas unifamiliares 2

Repite Houses pero con logaritmos... 

#+begin_src hansl 

#+end_src

  #+begin_src hansl

  #+end_src

#+begin_src hansl 
open data4-1                                  # cargar datos
logs sqft bedrms baths

Modelo1 <- ols price 0 l_sqft l_bedrms l_baths 

omit l_baths
omit l_bedrms

Modelo2 <- add  l_bedrms

dataset addobs 2
genr l_sqft[15]  =log(3000*1.01)
genr l_bedrms[15]=log(4)
genr l_baths[15] =log(3)

genr l_sqft[16]  =log(1065*1.01)
genr l_bedrms[16]=log(3)
genr l_baths[16] =log(1.75)

smpl 1 16
ols price 0 l_sqft l_bedrms 

fcast 14 15 --static        # prediccion para la casa mayor y mayor mas un 1% de sup.

fcast 1  1  --static        # prediccion para la casa menor
fcast 16 16 --static        # prediccion para la casa menor mas un 1% de superficie
#+end_src



\bibliographystyle{plain}
\bibliography{ref}
