Practicas/PracticasGretl/pub/Lecc08.tex

\subsection{Tareas}
\label{sec:org0b524f9}

\begin{description}
\item[{Actividad 1}] Piense cuáles son los signos esperados de los parámetros del modelo

\item[{Actividad 2}] Observe los diagramas de dispersión entre la variable
dependiente y los regresores. Observe así mismo los estadísticos
descriptivos de las variables y la matriz de correlaciones. Hágalo
con los menus desplegables o ejecutando el siguiente código:
\begin{verbatim}
summary BUSTRAVL FARE GASPRICE INCOME POP DENSITY LANDAREA --simple
corr BUSTRAVL FARE GASPRICE INCOME POP DENSITY LANDAREA --plot="display"  
fare_bustravl     <- gnuplot BUSTRAVL FARE     --output="display"
gasprice_bustravl <- gnuplot BUSTRAVL GASPRICE --output="display"
income_bustravl   <- gnuplot BUSTRAVL INCOME   --output="display"
pop_bustravl      <- gnuplot BUSTRAVL POP      --output="display"
density_bustravl  <- gnuplot BUSTRAVL DENSITY  --output="display"
landarea_bustravl <- gnuplot BUSTRAVL LANDAREA --output="display"
\end{verbatim}

\item[{Actividad 3}] Estime por MCO el modelo inicial completo y guárdelo como un icono
\begin{verbatim}
ModeloInicial <- ols BUSTRAVL 0 FARE GASPRICE INCOME POP DENSITY LANDAREA
modeltab add
\end{verbatim}
El nombre (en la línea anterior \texttt{ModeloInicial}) puede ser el que
usted elija, pero si tiene espacios en blanco debe escribirlo entre
comillas, por ejemplo \texttt{"Modelo uno"} \texttt{<- ols Y 0 x1 x2}). Recuerde
además que Gretl entiende la variable \texttt{0} como el regresor
constante).

Compare los resultados con sus expectativas iniciales.

\begin{itemize}
\item Observe qué variables son significativas y cuáles no. ¿Cuál es la
menos significativa?

\item Observe también el coeficiente de determinación ajustado, así como
los criterios de información para la selección de modelos
``Criterio de información de Akaike (AIC)'' y ``Criterio de
información Bayesiano de Schwarz (BIC)'' para compararlos con
otros alternativos más adelante.
\end{itemize}

\item[{Actividad 4}] La variable con mayor \emph{p}-valor (``la menos
significativa'') es el precio del combustible \texttt{GASPRICE}.
Realice una nueva regresión omitiendo esta variable.

Puede hacerlo partiendo del modelo anterior, o definiendo un nuevo
modelo (le recomiendo la primera):

\begin{itemize}
\item Partiendo del modelo anterior podemos omitir la variable:

\begin{itemize}
\item Desde la ventana del modelo estimado ``pinche'' en \textbf{\emph{\texttt{contrastes
      -{}-> omitir variables}}} seleccione \texttt{GASPRICE}; o bien
ejecute\footnote{el comando opuesto a \texttt{omit} es \texttt{add}}
\begin{verbatim}
omit GASPRICE
\end{verbatim}

\item Alternativamente podemos definir un nuevo modelo sin \texttt{GASPRICE}.
``pinchando'' en \textbf{\emph{\texttt{Modelo -{}-> Mínimos Cuadrados Ordinarios}}} y
seleccionando todos los regresores menos \texttt{GASPRICE}, o bien ejecutando
\texttt{ols BUSTRAVL 0 FARE INCOME POP DENSITY LANDAREA}
\end{itemize}

Analice los resultados:

\begin{itemize}
\item ¿Mejora la precisión de las estimaciones? ¿Qué variable es ahora
la menos significativa?

\item Observe también el coeficiente de determinación ajustado, así
como los criterios de información para la selección de modelos
``Criterio de información de Akaike (AIC)'' y ``Criterio de
información Bayesiano de Schwarz (BIC)''. ¿Le parece que ha
mejorado el modelo?
\end{itemize}
\end{itemize}

\item[{Actividad 5}] El mayor \emph{p}-valor corresponde ahora a \texttt{FARE}, pero
la teoría económica sugiere que el precio es una importante variable
a la hora de explicar la demanda de un bien o servicio. Por ello la
debemos mantener. La siguiente variable menos significativa (un
inaceptable \emph{p}-valor del 50\%) es la extensión de la ciudad
\texttt{LANDAREA}

Repita los pasos del punto anterior, pero omitiendo \texttt{LANDAREA}.
\begin{verbatim}
omit LANDAREA
\end{verbatim}

\item[{Actividad 6}] La variable \texttt{FARE} continua teniendo un \emph{p}-valor
excesivo (49\%). Esto sugiere, que dadas las demás variables
explicativas, la tarifa del billete no afecta demasiado a la demanda
de este servicio; es decir, los viajeros no parecer ser muy
sensibles al precio del billete\footnote{al menos para tarifas en torno a
las observadas en la muestra: alrededor de 0.8 dolares con una
tarifa mínima de 0.5\$ y una máxima de 1.5\$.}. Observe de nuevo el
diagrama de dispersión entre \texttt{FARE} y \texttt{BUSTRAVL} que siguiere este
comportamiento. Por tanto, veamos que pasa si finalmente omitimos la
variable \texttt{FARE} (si tenemos fundadas dudas sobre este comportamiento
de los consumidores, entonces \emph{no deberíamos eliminar la variable}
\texttt{FARE} del modelo).

Repita los pasos omitiendo \texttt{FARE}.
\begin{verbatim}
omit FARE 
\end{verbatim}

\item[{Actividad 7}] Las variables del modelo final son significativas y
los criterios de selección de modelos han mejorado, pero queda un
último paso.

Hemos ido ``quitando'' variables basándonos en los estadísticos
\Testadistico. Sabemos que esto es incorrecto puesto que
conjuntamente estas variables podrían ser significativas. Así pues,
debemos realizar un contraste de significación de las tres variables
conjuntamente; es decir, partiendo del modelo inicial debemos
contrastar
\begin{displaymath}
  \Hnula:\ \beta_2=0,\quad \beta_3=0,\quad \beta_7=0.
\end{displaymath}

\begin{itemize}
\item \emph{Partiendo del modelo inicial} omita de golpe las variables
\texttt{FARE}, \texttt{GASPRICE} y \texttt{LANDAREA} para obtener un modelo
restringido. Seleccione con el ratón la ventana del primer modelo
y en \textbf{\emph{\texttt{omitir}}} y marque las tres variables, o bien ejecute el
código:
\begin{verbatim}
ols BUSTRAVL 0 FARE GASPRICE INCOME POP DENSITY LANDAREA
ModeloFinal <- omit FARE GASPRICE LANDAREA
modeltab add
\end{verbatim}
¿Son conjuntamente significativas? ¿Mejora la precisión de las
estimaciones? ¿y los criterios de selección? ¿Son los signos de
los parámetros los esperados? A la luz de los resultados, viajar
en autobús ¿parece ser un bien normal, o un bien inferior?
\end{itemize}

\item[{Actividad 8}] Toda la inferencia que hemos realizado se basa en la
hipótesis de normalidad de los residuos. Contraste si se puede
rechazar o no la hipótesis de normalidad en ambos modelos (el
inicial y el final). El contraste Jarque-Bera es el más frecuente en
Econometría.
\begin{itemize}
\item En la ventana de resultados de un modelo ``pinche'' en
\textbf{\emph{\texttt{contrastes -{}-> Normalidad de los residuos}}}, o bien ejecute el
código:
\begin{verbatim}
series e = $uhat
normtest --all e
\end{verbatim}
Piense que los contrastes realizados en la anteriores actividades,
asumen la normalidad de las perturbaciones. Si esta hipótesis es
rechazada toda la inferencia de los contrates anteriores podría
quedar cuestionada.
\end{itemize}
\end{description}

\subsection{Código completo de la práctica \texttt{BusTravelers.inp}}
\label{sec:org29c0ce6}
\lstinputlisting{scripts/BusTravelers.inp}
\clearpage
\end{document}